Read me for the prolog class second assignment
Done by Leonardo Santos (201703489) and Lucas de Paula (201608440)


The file that contains all the predicates is called symbolic_dcg.pl

The code can be run using swipl, and compiled with the command ["symbolic_dcg.pl"].

All the predicates asked in the assignment were implemented, and here follow a few usage examples of them.

To access the demo, run the predicate 'polyplay.' . A prompt will be displayed, and help can be accessed by typing 'help'.

Available commands with examples
    1. add: 
        ?-add two times x to three
        >2*x+3

    2. Multiply a polynomial by a scalar: 
        ?- multiply two times x by three 
        >6*x

    3. Simplify a polynomial: 
        ?- simplify two times x squared plus two times x squared
        >4*x^2

    4. Show a polynomial: 
        ?- show two times x squared
        >2*x^2

    5. Store a polynomial: 
        ?-let p1 be x plus y

    6. Forget a polynomial:
        ?-forget p1

    7. Operation and storing the result: 
        ?-add p1 to p2 as p3 
        >2*x+2*y

    8. Leave the program:
        ?-bye





README FOR THE FIRST ASSIGNMENT -------------

The file that contains all the predicates is called sim.pl

The code can be run using swipl, and compiled with the command ["sim.pl"].

Poynomial simplifier:
All the predicates asked in the assignment were implemented, and here follow a few usage examples of them.

1.  poly2list/2 that transforms a list representing a polynomial (second
argument) into a polynomial represented as an expression (first argument)
and vice-versa.
    Queries: 
        ?- poly2list(2*x^2+x-3*x^5+y, X).
        X = [y, -3*x^5, x, 2*x^2].

        ?- poly2list(X, [2*x^2,x,-3*x^5,y]).
        X = y-3*x^5+x+2*x^2.

2.  simpoly_list/2 that simplifies a polynomial represented as a list into
another polynomial as a list.
    Queries:
        ?- simpoly_list([3*x^2,-2*x^2,7*y,-8], X).
        X = [x^2, 7*y, -8].


3. simpoly/2 that simplifies a polynomial represented as an expression
as another polynomial as an expression. This predicate can use the
previous one.
    Queries:
        ?- simpoly(3*x^2-2*x^2+7*y-8, X).
        X = x^2+7*y-8.

        ?- simpoly(x+8+2*x-9, X).
        X = 3*x-1.

4. scalepoly/3 that multiplies one polynomial as expression by a scalar
resulting in a seconed polynomial. The two first arguments are assumed
to be ground. The polynomial resulting from the sum is in
simplified form.  
    Queries:
        ?- scalepoly(2*x^2+x-3*x^5+y, 3, X).
        X = 6*x^2+3*x-9*x^5+3*y .      

        ?- scalepoly(2*x^2+x-3*x^5+y, -3, X).
        X = -6*x^2-3*x+9*x^5-3*y .

5.   addpoly/3 that adds two polynomials as expressions resulting in a
third one. The two first arguments are assumed to be ground. The
polynomial resulting from the sum is in simplified form.
    Queries:
        ?- addpoly(2*x^2+3*y^5+3*y^2, 2*x^2+2*y^2, X).
        X = 4*x^2+3*y^5+5*y^2 .

        ?- addpoly(2*x^2+3*y^5+3*y^2+4, 7, X).
        X = 2*x^2+3*y^5+3*y^2+11 .









